Enums/ВариантыОбеспечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВариантыОбеспечения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отгрузить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервироватьПоМереПоступления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОбеспечению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеТребуется</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыЗаказовКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыЗаказовКлиентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОбеспечению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОтгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказКлиента</Name>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТТМ_ПланПроизводства</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаказНаПроизводство2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказНаПроизводство2_2</Name>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТТМ_ПланПроизводства</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Продукция</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РесурсныеСпецификации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/РесурсныеСпецификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РесурсныеСпецификации</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОсновноеИзделиеВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОсновноеИзделиеНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСпецификаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыходныеИзделия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МатериалыИУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтатьяКалькуляции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиКалькуляции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ТТМ_Производство/Ext/Module.bsl
Процедура СформироватьЗаказыНаПроизводство(ЗаказКлиента,СвойстваОбъекта = Неопределено,ФормироватьЭтапы = Истина) Экспорт
	
	Если СвойстваОбъекта = Неопределено  Тогда
		СвойстваОбъекта = Новый Структура("Ссылка,Проведен,Статус,Товары");
		ЗаполнитьЗначенияСвойств(СвойстваОбъекта,ЗаказКлиента);
		СвойстваОбъекта.Товары = ЗаказКлиента.Товары.Выгрузить();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&Заказы КАК Ссылка,
	|	ТЧ_Товары.НомерСтроки КАК НомерСтроки,
	|	ТЧ_Товары.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ТЧ_Товары.Номенклатура КАК Номенклатура,
	|	ТЧ_Товары.Характеристика КАК Характеристика,
	|	ТЧ_Товары.Упаковка КАК Упаковка,
	|	ТЧ_Товары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ТЧ_Товары.Количество КАК Количество,
	|	ТЧ_Товары.ВидЦены КАК ВидЦены,
	|	ТЧ_Товары.Цена КАК Цена,
	|	ТЧ_Товары.Сумма КАК Сумма,
	|	ТЧ_Товары.СтавкаНДС КАК СтавкаНДС,
	|	ТЧ_Товары.СуммаНДС КАК СуммаНДС,
	|	ТЧ_Товары.СуммаСНДС КАК СуммаСНДС,
	|	ТЧ_Товары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|	ТЧ_Товары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	ТЧ_Товары.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
	|	ТЧ_Товары.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	|	ТЧ_Товары.ПричинаОтмены КАК ПричинаОтмены,
	|	ТЧ_Товары.КодСтроки КАК КодСтроки,
	|	ТЧ_Товары.Отменено КАК Отменено,
	|	ТЧ_Товары.КлючСвязи КАК КлючСвязи,
	|	ТЧ_Товары.Склад КАК Склад,
	|	ТЧ_Товары.СрокПоставки КАК СрокПоставки,
	|	ТЧ_Товары.Содержание КАК Содержание,
	|	ТЧ_Товары.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	ТЧ_Товары.ВариантОбеспечения КАК ВариантОбеспечения,
	|	ТЧ_Товары.Серия КАК Серия,
	|	ТЧ_Товары.НоменклатураНабора КАК НоменклатураНабора,
	|	ТЧ_Товары.Обособленно КАК Обособленно,
	|	ТЧ_Товары.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	ТЧ_Товары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТЧ_Товары.Подразделение КАК Подразделение,
	|	ТЧ_Товары.НоменклатураПартнера КАК НоменклатураПартнера,
	|	ТЧ_Товары.СуммаБонусныхБалловКСписанию КАК СуммаБонусныхБалловКСписанию,
	|	ТЧ_Товары.СуммаБонусныхБалловКСписаниюВВалюте КАК СуммаБонусныхБалловКСписаниюВВалюте,
	|	ТЧ_Товары.СуммаНачисленныхБонусныхБалловВВалюте КАК СуммаНачисленныхБонусныхБалловВВалюте,
	|	ТЧ_Товары.КоличествоТСД КАК КоличествоТСД
	|ПОМЕСТИТЬ вт_ТЧ0
	|ИЗ
	|	&ТЧ_Товары КАК ТЧ_Товары
	|;
	|//////////////////////////////////////////////////////////////////////////
	|
	|
	|ВЫБРАТЬ
	|	ТЧ_Товары.Ссылка КАК Ссылка,
	|	ТЧ_Товары.НомерСтроки КАК НомерСтроки,
	|	ТЧ_Товары.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ТЧ_Товары.Номенклатура КАК Номенклатура,
	|	ТЧ_Товары.Характеристика КАК Характеристика,
	|	ТЧ_Товары.Упаковка КАК Упаковка,
	|	ТЧ_Товары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ТЧ_Товары.Количество КАК Количество,
	|	ТЧ_Товары.ВидЦены КАК ВидЦены,
	|	ТЧ_Товары.Цена КАК Цена,
	|	ТЧ_Товары.Сумма КАК Сумма,
	|	ТЧ_Товары.СтавкаНДС КАК СтавкаНДС,
	|	ТЧ_Товары.СуммаНДС КАК СуммаНДС,
	|	ТЧ_Товары.СуммаСНДС КАК СуммаСНДС,
	|	ТЧ_Товары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|	ТЧ_Товары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	ТЧ_Товары.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
	|	ТЧ_Товары.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	|	ТЧ_Товары.ПричинаОтмены КАК ПричинаОтмены,
	|	ТЧ_Товары.КодСтроки КАК КодСтроки,
	|	ТЧ_Товары.Отменено КАК Отменено,
	|	ТЧ_Товары.КлючСвязи КАК КлючСвязи,
	|	ТЧ_Товары.Склад КАК Склад,
	|	ТЧ_Товары.СрокПоставки КАК СрокПоставки,
	|	ТЧ_Товары.Содержание КАК Содержание,
	|	ТЧ_Товары.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	ТЧ_Товары.ВариантОбеспечения КАК ВариантОбеспечения,
	|	ТЧ_Товары.Серия КАК Серия,
	|	ТЧ_Товары.НоменклатураНабора КАК НоменклатураНабора,
	|	ТЧ_Товары.Обособленно КАК Обособленно,
	|	ТЧ_Товары.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	ТЧ_Товары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТЧ_Товары.Подразделение КАК Подразделение,
	|	ТЧ_Товары.НоменклатураПартнера КАК НоменклатураПартнера,
	|	ТЧ_Товары.СуммаБонусныхБалловКСписанию КАК СуммаБонусныхБалловКСписанию,
	|	ТЧ_Товары.СуммаБонусныхБалловКСписаниюВВалюте КАК СуммаБонусныхБалловКСписаниюВВалюте,
	|	ТЧ_Товары.СуммаНачисленныхБонусныхБалловВВалюте КАК СуммаНачисленныхБонусныхБалловВВалюте,
	|	ТЧ_Товары.КоличествоТСД КАК КоличествоТСД
	|ПОМЕСТИТЬ вт_ТЧ
	|ИЗ
	|	вт_ТЧ0 КАК ТЧ_Товары
	|объединить все
	|
	|ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Ссылка,
	|	ЗаказКлиентаТовары.НомерСтроки,
	|	ЗаказКлиентаТовары.ДатаОтгрузки,
	|	ЗаказКлиентаТовары.Номенклатура,
	|	ЗаказКлиентаТовары.Характеристика,
	|	ЗаказКлиентаТовары.Упаковка,
	|	ЗаказКлиентаТовары.КоличествоУпаковок,
	|	ЗаказКлиентаТовары.Количество,
	|	ЗаказКлиентаТовары.ВидЦены,
	|	ЗаказКлиентаТовары.Цена,
	|	ЗаказКлиентаТовары.Сумма,
	|	ЗаказКлиентаТовары.СтавкаНДС,
	|	ЗаказКлиентаТовары.СуммаНДС,
	|	ЗаказКлиентаТовары.СуммаСНДС,
	|	ЗаказКлиентаТовары.ПроцентРучнойСкидки,
	|	ЗаказКлиентаТовары.СуммаРучнойСкидки,
	|	ЗаказКлиентаТовары.ПроцентАвтоматическойСкидки,
	|	ЗаказКлиентаТовары.СуммаАвтоматическойСкидки,
	|	ЗаказКлиентаТовары.ПричинаОтмены,
	|	ЗаказКлиентаТовары.КодСтроки,
	|	ЗаказКлиентаТовары.Отменено,
	|	ЗаказКлиентаТовары.КлючСвязи,
	|	ЗаказКлиентаТовары.Склад,
	|	ЗаказКлиентаТовары.СрокПоставки,
	|	ЗаказКлиентаТовары.Содержание,
	|	ЗаказКлиентаТовары.СтатусУказанияСерий,
	|	ЗаказКлиентаТовары.ВариантОбеспечения,
	|	ЗаказКлиентаТовары.Серия,
	|	ЗаказКлиентаТовары.НоменклатураНабора,
	|	ЗаказКлиентаТовары.Обособленно,
	|	ЗаказКлиентаТовары.ХарактеристикаНабора,
	|	ЗаказКлиентаТовары.ИдентификаторСтроки,
	|	ЗаказКлиентаТовары.Подразделение,
	|	ЗаказКлиентаТовары.НоменклатураПартнера,
	|	ЗаказКлиентаТовары.СуммаБонусныхБалловКСписанию,
	|	ЗаказКлиентаТовары.СуммаБонусныхБалловКСписаниюВВалюте,
	|	ЗаказКлиентаТовары.СуммаНачисленныхБонусныхБалловВВалюте,
	|	ЗаказКлиентаТовары.КоличествоТСД
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	
	|	;
	|//////////////////////////////////////////////////////////////////////////
	|
	|
	|ВЫБРАТЬ
	|	СпособыОбеспеченияПотребностей.Ссылка КАК СпособОбеспечения,
	|	СпособыОбеспеченияПотребностей.Организация КАК Организация
	|ПОМЕСТИТЬ вт_СпособыОбеспечения
	|ИЗ
	|	Справочник.СпособыОбеспеченияПотребностей КАК СпособыОбеспеченияПотребностей
	|ГДЕ
	|	СпособыОбеспеченияПотребностей.ТипОбеспечения = ЗНАЧЕНИЕ(Перечисление.ТипыОбеспечения.Производство)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Назначения.Ссылка КАК Назначение,
	|	Назначения.Заказ КАК Заказ
	|ПОМЕСТИТЬ вт_Назначения
	|ИЗ
	|	Справочник.Назначения КАК Назначения
	|ГДЕ
	|	НЕ Назначения.ПометкаУдаления
	|	И Назначения.Заказ В(&Заказы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ЗаказКлиентаТовары.КоличествоУпаковок) КАК ВСтрокеЗаказа,
	|	СУММА(0 * ЗаказКлиентаТовары.КоличествоУпаковок) КАК ВЗаказеК,
	|	СУММА(0 * ЗаказКлиентаТовары.КоличествоУпаковок) КАК ВЗаказеП,
	|	СУММА(0 * ЗаказКлиентаТовары.КоличествоУпаковок) КАК ПотребностьФакт,
	|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
	|	ЗаказКлиентаТовары.Ссылка.Склад КАК Склад,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеПолучатель,
	|	ЗаказКлиентаТовары.Ссылка КАК Заказ,
	|	ЗаказКлиентаТовары.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ЗаказКлиентаТовары.ДатаОтгрузки КАК ДатаПоставки,
	|	ЗаказКлиентаТовары.Ссылка.Подразделение КАК ИсточникОбеспечения,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбеспечения.Производство) КАК ТипОбеспечения,
	|	СУММА(0 * ЗаказКлиентаТовары.КоличествоУпаковок) КАК КЗаказу,
	|	МАКСИМУМ(1) КАК ЧислительУпаковки,
	|	МАКСИМУМ(1) КАК ЗнаменательУпаковки,
	|	СУММА(0) КАК МинимальнаяПартияПоставки,
	|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) КАК УпаковкаЗаказа,
	|	ЗНАЧЕНИЕ(Справочник.СоглашенияСКлиентами.ПустаяСсылка) КАК Соглашение,
	|	ИСТИНА КАК Отметка,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук) КАК ТипЕдиницыИзмерения,
	|	ЛОЖЬ КАК НеОкруглятьПередСозданиемЗаказа,
	|	ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка) КАК ВидЦены,
	|	вт_Назначения.Назначение КАК Назначение,
	|	СхемыОбеспечения.СпособОбеспеченияПотребностей КАК СпособОбеспечения,
	|	ЗаказКлиентаТовары.Упаковка КАК Упаковка
	|ИЗ
	|	//Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|	вт_ТЧ КАК ЗаказКлиентаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_Назначения КАК вт_Назначения
	|		ПО ЗаказКлиентаТовары.Ссылка = вт_Назначения.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СхемыОбеспечения КАК СхемыОбеспечения
	|		ПО ЗаказКлиентаТовары.Ссылка.Склад = СхемыОбеспечения.Склад
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка В(&Заказы)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Номенклатура,
	|	ЗаказКлиентаТовары.Характеристика,
	|	ЗаказКлиентаТовары.Ссылка.Склад,
	|	ЗаказКлиентаТовары.Ссылка,
	|	ЗаказКлиентаТовары.ДатаОтгрузки,
	|	ЗаказКлиентаТовары.Ссылка.Подразделение,
	|	вт_Назначения.Назначение,
	|	СхемыОбеспечения.СпособОбеспеченияПотребностей,
	|	ЗаказКлиентаТовары.Упаковка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаОтгрузки УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////";
	
	Запрос.УстановитьПараметр("Заказы", ЗаказКлиента);
	Запрос.УстановитьПараметр("ТЧ_Товары", СвойстваОбъекта.Товары);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	ТЗ = РезультатЗапроса.Выгрузить();
	
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ЗаказКлиентаТовары.Количество) КАК Количество,
	|	ЗаказКлиентаТовары.Ссылка КАК Заказ,
	|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
	|	СУММА(0) КАК КоличествоОтгружено,
	|	СУММА(0) КАК КоличествоОтменено
	|ПОМЕСТИТЬ вт_Потребность0
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка.Проведен
	|	И &ОбъектПроведенСогласован
	|	И НЕ ЗаказКлиентаТовары.Отменено
	|	И ЗаказКлиентаТовары.Ссылка В(&Заказы)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Номенклатура,
	|	ЗаказКлиентаТовары.Ссылка,
	|	ЗаказКлиентаТовары.Характеристика
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Номенклатура,
	|	СУММА(0),
	|	ЗаказКлиентаТовары.Ссылка,
	|	ЗаказКлиентаТовары.Характеристика,
	|	СУММА(0),
	|	СУММА(ЗаказКлиентаТовары.Количество)
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка.Проведен
	|	И &ОбъектПроведенСогласован
	|	И НЕ ЗаказКлиентаТовары.Отменено
	|	И ЗаказКлиентаТовары.Ссылка В(&Заказы)
	|	И ЗаказКлиентаТовары.Отменено
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Номенклатура,
	|	ЗаказКлиентаТовары.Ссылка,
	|	ЗаказКлиентаТовары.Характеристика
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Номенклатура,
	|	СУММА(0),
	|	ЗаказКлиентаТовары.Ссылка,
	|	ЗаказКлиентаТовары.Характеристика,
	|	СУММА(ЗаказКлиентаТовары.Количество),
	|	СУММА(0)
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка.Проведен
	|	И &ОбъектПроведенСогласован
	|	И НЕ ЗаказКлиентаТовары.Отменено
	|	И ЗаказКлиентаТовары.Ссылка В(&Заказы)
	|	И ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Номенклатура,
	|	ЗаказКлиентаТовары.Ссылка,
	|	ЗаказКлиентаТовары.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Потребность0.Номенклатура КАК Номенклатура,
	|	вт_Потребность0.Характеристика КАК Характеристика,
	|	СУММА(вт_Потребность0.Количество) КАК Количество,
	|	СУММА(вт_Потребность0.КоличествоОтгружено) КАК КоличествоОтгружено,
	|	СУММА(вт_Потребность0.КоличествоОтменено) КАК КоличествоОтменено,
	|	вт_Потребность0.Заказ КАК Заказ
	|ПОМЕСТИТЬ вт_Потребность
	|ИЗ
	|	вт_Потребность0 КАК вт_Потребность0
	|
	|СГРУППИРОВАТЬ ПО
	|	вт_Потребность0.Номенклатура,
	|	вт_Потребность0.Характеристика,
	|	вт_Потребность0.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказНаПроизводство2_2Продукция.Номенклатура КАК Номенклатура,
	|	СУММА(ЗаказНаПроизводство2_2Продукция.Количество) КАК Количество,
	|	ЗаказНаПроизводство2_2Продукция.Назначение.Заказ КАК Заказ,
	|	ЗаказНаПроизводство2_2Продукция.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ЗаказНаПроизводство2_2Продукция.Отменено
	|			ТОГДА ЗаказНаПроизводство2_2Продукция.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОтменаЗП
	|ПОМЕСТИТЬ вт_ЗаказаноВПроизводство
	|ИЗ
	|	вт_Потребность КАК вт_Потребность
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство2_2.Продукция КАК ЗаказНаПроизводство2_2Продукция
	|		ПО вт_Потребность.Номенклатура = ЗаказНаПроизводство2_2Продукция.Номенклатура
	|			И вт_Потребность.Характеристика = ЗаказНаПроизводство2_2Продукция.Характеристика
	|			И вт_Потребность.Заказ = ЗаказНаПроизводство2_2Продукция.Назначение.Заказ
	|ГДЕ
	|	ЗаказНаПроизводство2_2Продукция.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказНаПроизводство2_2Продукция.Номенклатура,
	|	ЗаказНаПроизводство2_2Продукция.Назначение.Заказ,
	|	ЗаказНаПроизводство2_2Продукция.Характеристика,
	|	ВЫБОР
	|		КОГДА ЗаказНаПроизводство2_2Продукция.Отменено
	|			ТОГДА ЗаказНаПроизводство2_2Продукция.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Потребность.Номенклатура КАК Номенклатура,
	|	вт_Потребность.Количество КАК ВЗаказеК,
	|	ЕСТЬNULL(вт_ЗаказаноВПроизводство.Количество, 0) КАК ВЗаказеП,
	|	вт_Потребность.Количество - ЕСТЬNULL(вт_ЗаказаноВПроизводство.Количество, 0) КАК ПотребностьФакт,
	|	вт_Потребность.КоличествоОтгружено КАК КоличествоОтгружено,
	|	вт_Потребность.КоличествоОтменено КАК КоличествоОтменено,
	|	вт_Потребность.Заказ КАК Заказ,
	|	ЕСТЬNULL(вт_ЗаказаноВПроизводство.ОтменаЗП, 0) КАК ОтменаЗП
	|ПОМЕСТИТЬ вт_ПотребностьСгруппированная
	|ИЗ
	|	вт_Потребность КАК вт_Потребность
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ЗаказаноВПроизводство КАК вт_ЗаказаноВПроизводство
	|		ПО вт_Потребность.Номенклатура = вт_ЗаказаноВПроизводство.Номенклатура
	|			И вт_Потребность.Характеристика = вт_ЗаказаноВПроизводство.Характеристика
	|			И вт_Потребность.Заказ = вт_ЗаказаноВПроизводство.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПроизводствоБезЗаказаВыходныеИзделия.Номенклатура КАК Номенклатура,
	|	СУММА(ПроизводствоБезЗаказаВыходныеИзделия.Количество) КАК БезЗаказа,
	|	ПроизводствоБезЗаказаВыходныеИзделия.Назначение КАК Назначение,
	|	ПроизводствоБезЗаказаВыходныеИзделия.Назначение.Заказ КАК Заказ
	|ПОМЕСТИТЬ вт_ПроизводствоБезЗаказа
	|ИЗ
	|	вт_Потребность КАК вт_Потребность
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа.ВыходныеИзделия КАК ПроизводствоБезЗаказаВыходныеИзделия
	|		ПО вт_Потребность.Номенклатура = ПроизводствоБезЗаказаВыходныеИзделия.Номенклатура
	|			И вт_Потребность.Заказ = ПроизводствоБезЗаказаВыходныеИзделия.Назначение.Заказ
	|			И (ПроизводствоБезЗаказаВыходныеИзделия.Ссылка.Проведен)
	|ГДЕ
	|	НЕ ПроизводствоБезЗаказаВыходныеИзделия.Номенклатура ЕСТЬ NULL
	|	И ПроизводствоБезЗаказаВыходныеИзделия.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ПроизводствоБезЗаказаВыходныеИзделия.Номенклатура,
	|	ПроизводствоБезЗаказаВыходныеИзделия.Назначение,
	|	ПроизводствоБезЗаказаВыходныеИзделия.Назначение.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура КАК Номенклатура,
	|	СУММА(ЭтапПроизводства2_2ВыходныеИзделия.Количество) КАК ВЭтапах,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Назначение КАК Назначение,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Назначение.Заказ КАК Заказ
	|ПОМЕСТИТЬ вт_ПроизводствоЭтапы
	|ИЗ
	|	вт_Потребность КАК вт_Потребность
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
	|		ПО вт_Потребность.Номенклатура = ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура
	|			И вт_Потребность.Заказ = ЭтапПроизводства2_2ВыходныеИзделия.Назначение.Заказ
	|			И (ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Проведен)
	|ГДЕ
	|	НЕ ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура ЕСТЬ NULL
	|	И ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Назначение,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Назначение.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_ПотребностьСгруппированная.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(вт_ПотребностьСгруппированная.ВЗаказеК) КАК ВЗаказеК,
	|	МАКСИМУМ(вт_ПотребностьСгруппированная.ВЗаказеП) КАК ВЗаказеП,
	|	МИНИМУМ(вт_ПотребностьСгруппированная.КоличествоОтгружено) КАК КОтгрузке,
	|	МАКСИМУМ(вт_ПотребностьСгруппированная.КоличествоОтменено) КАК Отменено,
	|	СУММА(ЕСТЬNULL(вт_ПроизводствоБезЗаказа.БезЗаказа, 0)) КАК БезЗаказа,
	|	СУММА(ЕСТЬNULL(вт_ПроизводствоЭтапы.ВЭтапах, 0)) КАК ВЭтапах,
	|	СУММА(вт_ПотребностьСгруппированная.ОтменаЗП) КАК ОтменаЗП,
	|	вт_ПотребностьСгруппированная.Заказ КАК Заказ
	|ПОМЕСТИТЬ вт_Итог
	|ИЗ
	|	вт_ПотребностьСгруппированная КАК вт_ПотребностьСгруппированная
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ПроизводствоБезЗаказа КАК вт_ПроизводствоБезЗаказа
	|		ПО вт_ПотребностьСгруппированная.Номенклатура = вт_ПроизводствоБезЗаказа.Номенклатура
	|			И вт_ПотребностьСгруппированная.Заказ = вт_ПроизводствоБезЗаказа.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ПроизводствоЭтапы КАК вт_ПроизводствоЭтапы
	|		ПО вт_ПотребностьСгруппированная.Номенклатура = вт_ПроизводствоЭтапы.Номенклатура
	|			И (вт_ПроизводствоЭтапы.Заказ = вт_ПотребностьСгруппированная.Заказ)
	|ГДЕ
	|	вт_ПотребностьСгруппированная.Номенклатура В ИЕРАРХИИ(&Номенклатура)
	|
	|СГРУППИРОВАТЬ ПО
	|	вт_ПотребностьСгруппированная.Номенклатура,
	|	вт_ПотребностьСгруппированная.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Итог.Номенклатура КАК Номенклатура,
	|	вт_Итог.ВЗаказеК КАК ВЗаказеК,
	|	вт_Итог.ВЗаказеП КАК ВЗаказеП,
	|	вт_Итог.КОтгрузке КАК КОтгрузке,
	|	вт_Итог.Отменено КАК Отменено,
	|	вт_Итог.БезЗаказа КАК БезЗаказа,
	|	вт_Итог.ВЗаказеК - вт_Итог.Отменено - (вт_Итог.ВЗаказеП - вт_Итог.ОтменаЗП + вт_Итог.БезЗаказа) КАК ПотребностьФакт,
	|	вт_Итог.ВЗаказеК - вт_Итог.Отменено - (вт_Итог.ВЗаказеП - вт_Итог.ОтменаЗП + вт_Итог.БезЗаказа) КАК КЗаказу,
	|	вт_Итог.ВЗаказеП - вт_Итог.ОтменаЗП + вт_Итог.БезЗаказа КАК НеМеньше,
	|	вт_Итог.ВЭтапах КАК ВЭтапах,
	|	вт_Итог.Заказ КАК Заказ
	|ИЗ
	|	вт_Итог КАК вт_Итог";
	
	Запрос.УстановитьПараметр("Заказы", ЗаказКлиента);
	Запрос.УстановитьПараметр("Номенклатура", справочники.Номенклатура.ПустаяСсылка());
	Запрос.УстановитьПараметр("ОбъектПроведенСогласован",СвойстваОбъекта.Проведен 
	и (СвойстваОбъекта.Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению 
	Или СвойстваОбъекта.Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Отбор = Новый Структура("Заказ,Номенклатура");
		ЗаполнитьЗначенияСвойств(Отбор,ВыборкаДетальныеЗаписи);
		мСтрокиТовара = ТЗ.НайтиСтроки(Отбор);
		ДанныеВыборки = Новый Структура("Номенклатура,кЗаказу,ВЗаказеК,ВЗаказеП,ПотребностьФакт");
		ЗаполнитьЗначенияСвойств(ДанныеВыборки,ВыборкаДетальныеЗаписи);
		Для каждого стр из мСтрокиТовара Цикл
			стр.ВЗаказеК = стр.ВСтрокеЗаказа;
			//ЗаполнитьЗначенияСвойств(стр,ВыборкаДетальныеЗаписи,"кЗаказу,ВЗаказеК,ВЗаказеП,ПотребностьФакт");
			Если ДанныеВыборки.Кзаказу = 0 Тогда
				Продолжить;
			КонецЕсли;
			Если стр.ВСтрокеЗаказа <= ДанныеВыборки.кЗаказу Тогда
				стр.КЗаказу = стр.ВСтрокеЗаказа;
				ДанныеВыборки.Кзаказу = ДанныеВыборки.КЗаказу - стр.ВСтрокеЗаказа;
			Иначе
				ДанныеВыборки.Кзаказу = стр.КЗаказу;
				ДанныеВыборки.Кзаказу = 0;
			КонецЕсли;
			стр.Отметка = (Стр.Кзаказу>0);
		КонецЦикла;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	ТЗ.Сортировать("Номенклатура,ДатаОтгрузки");
	Потребности = ТЗ.Скопировать();
	
	Если Потребности.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	
	УИН = Новый УникальныйИдентификатор;
	Данные = Новый Структура("Тест");
	АдресХранилища = ПоместитьВоВременноеХранилище(Данные,УИН);
	//АдресРезультатаФормированияЗаказов	"e1cib/tempstorage/3550da04-f66d-433c-9de5-68577e3b2951?seanceId=MDE4MDQ4ZjgtZjE1MS00OTVhLWI0MmUtNTcxOTI4YjU3MGNmjnubRIyHKE26fOCtNEg3ywAAAAA"	Строка
	//ИспользоватьУпаковки	Истина	Булево
	//ТаблицаДокументов	ТаблицаЗначений	ТаблицаЗначений
	//ТаблицаПотребностей	ТаблицаЗначений	ТаблицаЗначений
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Булево"));
	ОписаниеБулево = Новый ОписаниеТипов(МассивТипов);
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Дата"));
	ОписаниеДата = Новый ОписаниеТипов(МассивТипов);
	КвалификаторДаты = Новый КвалификаторыДаты(ЧастиДаты.Дата);
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ДокументСсылка.ЗаказНаПроизводство"));
	ОписаниеЗП = Новый ОписаниеТипов(МассивТипов);
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.Организации"));
	ОписаниеОрг = Новый ОписаниеТипов(МассивТипов);
	
	
	
	ТаблицаДокументов = Новый ТаблицаЗначений;
	ТаблицаДокументов.Колонки.Добавить("Валюта",Новый ОписаниеТипов(ОписаниеБулево));
	ТаблицаДокументов.Колонки.Добавить("ДатаПоставки",Новый ОписаниеТипов(ОписаниеДата,,,,,КвалификаторДаты));
	ТаблицаДокументов.Колонки.Добавить("Документ",Новый ОписаниеТипов(ОписаниеЗП));
	ТаблицаДокументов.Колонки.Добавить("ИспользованиеСтатусов",Новый ОписаниеТипов(ОписаниеБулево));
	//ТаблицаДокументов.Колонки.Добавить("ИспользованиеСтатусов",Новый ОписаниеТипов(ОписаниеБулево));
	ТаблицаДокументов.Колонки.Добавить("ИсточникОбеспечения");
	//ТаблицаДокументов.Колонки.Добавить("Организация",ОписаниеОрг);
	ТаблицаДокументов.Колонки.Добавить("Организация");
	ТаблицаДокументов.Колонки.Добавить("СпособОбеспечения");
	ТаблицаДокументов.Колонки.Добавить("СтандартнаяКартинка");
	ТаблицаДокументов.Колонки.Добавить("Статус");
	ТаблицаДокументов.Колонки.Добавить("Сумма");
	
	
	
	
	
	
	
	ПараметрыФормирования = Новый Структура;
	ПараметрыФормирования.Вставить("АдресРезультатаФормированияЗаказов",АдресХранилища);
	ПараметрыФормирования.Вставить("ИспользоватьУпаковки",Истина);
	ПараметрыФормирования.Вставить("ТаблицаДокументов", ТаблицаДокументов);
	ПараметрыФормирования.Вставить("ТаблицаПотребностей",Потребности.Скопировать());
	ПараметрыФормирования.Вставить("СписокСообщений",Новый Массив);
	
	//УИН = Новый УникальныйИдентификатор;
	Данные.Вставить("ТаблицаДокументов",ТаблицаДокументов);
	АдресХранилища = ПоместитьВоВременноеХранилище(Данные,УИН);

	
	Обработки.ОбеспечениеПотребностей.СформироватьЗаказы(ПараметрыФормирования,АдресХранилища);
	ПараметрыФормирования = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	Если ФормироватьЭтапы Тогда
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
		// Данный фрагмент построен конструктором.
		// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаказНаПроизводство2_2Продукция.Ссылка КАК ЗаказНаПроизводство,
		|	ЗаказНаПроизводство2_2Продукция.Спецификация КАК Спецификация,
		|	ЗаказНаПроизводство2_2Продукция.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ вт_ЗаказыНаПроизводство
		|ИЗ
		|	Документ.ЗаказНаПроизводство2_2.Продукция КАК ЗаказНаПроизводство2_2Продукция
		|ГДЕ
		|	ЗаказНаПроизводство2_2Продукция.Ссылка.Проведен
		|	И ЗаказНаПроизводство2_2Продукция.Назначение.Заказ В(&Заказ)
		|	И ЗаказНаПроизводство2_2Продукция.Номенклатура В(&Номенклатура)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	вт_ЗаказыНаПроизводство.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
		|	вт_ЗаказыНаПроизводство.Номенклатура КАК Номенклатура,
		|	вт_ЗаказыНаПроизводство.Спецификация КАК Спецификация,
		|	вт_ЗаказыНаПроизводство.Спецификация<>Значение(Справочник.РесурсныеСпецификации.ПустаяСсылка) КАК ЕстьСпецификация,
		|	ЕСТЬNULL(ЭтапПроизводства2_2.Ссылка, ЗНАЧЕНИЕ(Документ.ЭтапПроизводства2_2.ПустаяСсылка)) КАК ЭтапПроизводства
		|ИЗ
		|	вт_ЗаказыНаПроизводство КАК вт_ЗаказыНаПроизводство
		|		Левое СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
		|		ПО (ЭтапПроизводства2_2.Проведен)
		|			И вт_ЗаказыНаПроизводство.ЗаказНаПроизводство = ЭтапПроизводства2_2.Распоряжение";
		
		Запрос.УстановитьПараметр("Заказ", Потребности.ВыгрузитьКолонку("Заказ"));
		Запрос.УстановитьПараметр("Номенклатура", Потребности.ВыгрузитьКолонку("Номенклатура"));
		Запрос.УстановитьПараметр("&ОбъектПроведенСогласован",СвойстваОбъекта.Проведен 
		и (СвойстваОбъекта.Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению 
		Или СвойстваОбъекта.Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		//
		//
		//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
		//КонецЦикла;
		
		//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
		ТЗ_Заказы = РезультатЗапроса.Выгрузить();
		мСоспецификацией = ТЗ_Заказы.НайтиСтроки(Новый Структура("ЕстьСпецификация",Истина));
		мРаспоряжения = ТЗ_Заказы.Скопировать(мСоспецификацией).ВыгрузитьКолонку("ЗаказНаПроизводство");
		
		
		
		
		//Djpdhfn$
		//нужны параметры формирования этапов.
		
		ПараметрыЭП = Документы.ЭтапПроизводства2_2.ПараметрыФормированияЭтапов();;
		//Параметры.Вставить("ПередатьЭтапыКВыполнению", Истина);
		ПараметрыЭП.Вставить("РассчитатьГрафик", Истина);//на форме
		ПараметрыЭП.Вставить("Распоряжения",мРаспоряжения);
		//Результат.Распоряжения = Параметры.Распоряжения;
		Если мРаспоряжения.Количество() > 0 Тогда
			Документы.ЭтапПроизводства2_2.СформироватьЭтапы(ПараметрыЭП, АдресХранилища);
		КонецЕсли;
		
		//КалендарныеГрафики.ДатаПоКалендарю(Справочники.ПроизводственныеКалендари.НайтиПоНаименованию("Российская Федерация"), ДатаПотребности, 5)
	КонецЕсли;	
КонецПроцедуры
